[
  {
    "id": 1,
    "name": "Bench Press",
    "image": "https://www.verywellfit.com/thmb/rFLCeHZBQ1mB5x1JQgndRMYIfVs=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/29-3498606-Bench-Press-GIF-b26faabc528b48a8b3a145797ddfa0e3.gif",
    "description": "The bench press builds the muscles of the chest as well as the triceps of the back of the arms and the front deltoid shoulder muscles. You can do this exercise with barbells, dumbbells, or with a Smith machine, which constrains the path of the barbell and makes the exercise a little easier. You will often learn the bench press in a strength training program. Beginners should try lifts without weight on the bar to warm up, get a feel for the bar, and learn to do it with good form. You can use it regularly as part of an upper body workout for strength and muscle development.",
    "benefits": "The bench press is a compound exercise that involves the pectoralis major of the chest, the anterior deltoids of the shoulder, and the triceps brachii of the upper arm. It builds strength as well as encourages the growth of these muscles. Muscle growth is not only desired by bodybuilders, but also for anybody over age 40 when age-related muscle loss is a concern.1﻿ It is a functional exercise that helps you with any daily activities that require pushing or carrying. The bench press can help restore muscle balance for athletes that primarily use pulling muscles, such as in wrestling, rock climbing, and swimming. The barbell bench press is a competitive lift in the sport of powerlifting, with the other two being the deadlift and squat. If you're training for competition powerlifting, you should contact a professional coach for personal instruction.",
    "instructions": "Lie flat on the bench under the rack that holds the bar. Your eyes should be approximately aligned with the front of the barbell rack uprights. Butt, shoulders, and head should be flat on the bench with a slight bend in the spine. Feet should be flat on the floor and relatively wide apart. Grasp the bar with your thumbs on the outside of your closed fist, overhand grip, with arms slightly wider than shoulder-width apart. The angle of the upper arms should be at about 45 degrees to the body. Remove the barbell from the rack and lock the elbows out before lowering the bar to the chest at the nipple line. Don't move the bar in an arc from the rack directly to the chest position. With the Smith machine, you can't do this; the path is restricted. Take a deep breath and raise the bar to above the chest with arms extended, exhaling while you push upward and aiming consistently at the same spot on the ceiling. Don't watch the bar; focus on the ceiling. Return the bar to just above the chest and repeat the exercise. Three sets of 10 reps is a suggested number. To finish, replace the bar on the rack from the locked out position. Move the bar backward gradually until you feel the rack uprights, then lower the bar to the rack rest. Do not try to hit the rack rests directly. If you miss, you can lose control, which can be dangerous.",
    "variations": "If you are not at ease with feet on the floor because of short legs, use blocks or weight plates under the feet to boost height rather than placing legs on the bench, which reduces stability. If you have any concerns about shoulder joint stability, don't lower the bar so far that the top part of the arm falls much below parallel.",
    "precautions": "If you have any injury to your shoulders, you should avoid the bench press. If you feel any shoulder pain during the bench press, replace the weights and end the exercise. If you are bench pressing a heavy weight, do so only with the assistance of a spotter. It is also good to use a power rack, which has bars on either side set at the level of your chest. If your lift fails, the bars will prevent the barbell from crushing your chest.",
    "muscles": "Chest, triceps, shoulders",
    "muscle_img": "https://chunkfitness.com/sites/default/files/bench-presses-barbell.jpg",
    "level": "Intermediate"
  },

  {
    "id": 2,
    "name": "Leg Press",
    "image": "https://www.verywellfit.com/thmb/zvYe9SCVETU8sqQ6cFImaze3bz8=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/50-3498610-Leg-Press-GIF-689350b314ef47f4802f7fc74349b410.gif",
    "description": "The leg press is a popular piece of gym equipment that can help build key muscles in your legs. There are two types of leg press machines commonly found in gyms: the standard horizontal leg press and the 45-degree leg press that has a seat that reclines at an angle while your legs press upward in a diagonal direction. Both machines are used to develop the quadriceps and hamstrings of the thigh as well as the gluteus (buttocks). While it seems like a simple exercise, it's important to learn how to use it properly. By paying attention to your form, you can maximize the strength-building benefits and prevent injury. The leg press is used as part of a leg strengthening routine or a machine circuit workout.The leg press machine allows you to get the benefits of a barbell squat for developing the quadriceps. Secondarily, it develops the gluteus maximus, hamstrings, and calves. By varying your foot position you can emphasize different muscles. It builds strength in these muscles and you can use it to overcome imbalances, such as when runners have more developed hamstrings than quadriceps.Avoid the leg press if you have weak pelvic floor muscles as it places a lot of stress on the pelvic floor. Instead, do safer leg strengthening exercises as recommended by your doctor or physical therapist. You should not use this machine if you have a knee injury. If one or both of your knees hurt, do not push through the pain. Pushing through will only cause injury. This exercise can also place stress on your back, so it should be avoided if you have a back injury or back pain.",
    "benefits": "The leg press machine allows you to get the benefits of a barbell squat for developing the quadriceps. Secondarily, it develops the gluteus maximus, hamstrings, and calves. By varying your foot position you can emphasize different muscles. It builds strength in these muscles and you can use it to overcome imbalances, such as when runners have more developed hamstrings than quadriceps.",
    "instructions": "Brace your abdominal muscles and push the platform away with your heels and forefoot. Your heels should remain flat on the footplate. The front of your foot or toes should never be used exclusively to move the pad forward. While exhaling, extend your legs and keep your head and back flat against the seat pad. Extend with slow control rather than with an explosive movement. Pause at the top of the movement. Do not lock out your knees and ensure that they are not bowing out or in. While inhaling, return the footplate to the starting position by gradually bending the knees. Keep the feet and back flat throughout. If you have never done leg presses before, start modestly with three sets of 10 leg presses. You can advance from there as you build strength.",
    "variations": "You can adjust the leg press to make it more accessible as a beginner and to use it to progress. This is a very individual exercise that you need to adjust to fit your body. As machines can vary, you may want to ask a trainer to show you how to adjust it safely before starting. Beginners should use lighter weights and develop good form. Concentrate on slow and deliberate movements rather than how many reps or the amount of weight you're lifting. If you notice any unwarranted stress or pain, ask a trainer to review your form and get some personalized advice.",
    "precautions": "Avoid the leg press if you have weak pelvic floor muscles as it places a lot of stress on the pelvic floor. Instead, do safer leg strengthening exercises as recommended by your doctor or physical therapist. You should not use this machine if you have a knee injury. If one or both of your knees hurt, do not push through the pain. Pushing through will only cause injury. This exercise can also place stress on your back, so it should be avoided if you have a back injury or back pain.",
    "muscles": "Quadriceps, hamstrings, gluteus maximus",
    "muscle_img": "https://static.webshopapp.com/shops/052189/files/031834430/muscles-legpress.jpg",
    "level": "Beginner"
  },

  {
    "id": 3,
    "name": "Crossover Crunch",
    "image": "https://www.verywellfit.com/thmb/PY_pN52qAfxH1MZw33uCS9_aERM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/103-3120063-Crossover-CrunchGIF-275225a17f6844bfa953ef8a48c53d3a.gif",
    "description": "The crossover crunch is a fantastic beginner ab exercise that works more than your abdominal muscles—it also targets your external obliques and internal obliques, helping you feel more 'pulled in' at the waist. While the crossover crunch is considered a beginner core move, you can add it to an intense workout or use variations to make the exercise more challenging.",
    "benefits": "The ab-toning benefits of a full-core workout may have enticed you to add them to your workout routine, but having a strong core can do more than enhance your physique—it also benefits your overall physical health and strength. The muscles of your core provide key support for your spine. Strong abdominal muscles can improve posture and even help manage, reduce, or prevent back pain.",
    "instructions": "Start by taking a nice deep breath and focusing on your abs. Lay flat on the mat with your body positioned in a straight line from the top of your head, down your spine, and into your tailbone. Place your hands behind your head, elbows out. Inhale as you cross your left leg over your right resting your left ankle your right knee. Exhale as you contract your abdominal muscles and slowly raise your upper body off the mat (similar to a basic crunch). Slowly twist your torso to your left as you squeeze your abs, bringing your right elbow to your left knee until they touch. Inhale as you slowly lower your upper body back down to the mat.",
    "variations": "If you need to change your arm or hand positions, or just want to change things up, try these variations on the classic hand-and-arm position for crunches: Place your fingertips to the side of your head, just behind your ears. Lace your fingers behind your head cradling the base of your skull (for this position, just make sure you aren't using your arms to pull your head up as you crunch). Place the fingertips of one hand at the side of your head and extend the other arm out to the side so it's perpendicular to your body.",
    "precautions": "Basic crunches or variations like the crossover crunch are a beginner exercises that most people can perform as long as they use proper form. However, if you've had an injury involving your neck or back, you may want to avoid any crunch-based exercises. If you've had surgery for these conditions, be sure to ask your doctor or physical therapist about when you can resume exercise. They may also provide recommendations for workouts for regaining strength without risking further injury. If you've recently been pregnant or given birth, ask your doctor before starting a postpartum ab workout. If you have a condition called diastasis recti (the muscles of your abdomen have separated), you may need to avoid exercises that work your core until you're healed. As you're performing crossover crunches, if you feel any pain or discomfort in your neck, especially while your arm is extended or with your fingertips behind the ears, you may need to try a different position to support your neck.",
    "muscles": "Abdominal",
    "muscle_img": "https://chunkfitness.com/sites/all/themes/cf2/images/muscle-charts/original/abs.jpg",
    "level": "Beginner"
  },
  {
    "id": 4,
    "name": "TRX Biceps Curl",
    "image": "https://www.verywellfit.com/thmb/uRY3QEXHJF-UZYlJvCmD5eTLVAI=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/72-4589435-TRX-Bicep-Curl-GIF-f4196c85bebd416cb102b2b8995f3ddf.gif",
    "description": "The TRX biceps curl uses suspension cables instead of typical free weights or bands. Performing a biceps curl while suspended challenges your body in conditions of instability. This forces you to constantly engage your core to perform the movement. The exercise not only works your biceps but helps to improve your balance and overall strength. Adjusting the level of difficulty for this exercise is an easy shift of your body position and cable angles. TRX training claims to provide an effective workout with simple equipment. This is one of the many popular reasons people are trying suspension training. The adjustable bands are suitable for the novice exerciser to the advanced athlete and can be modified to fit every fitness level. Many individuals are using this method of exercise to round out an existing exercise program. If you’re considering TRX training and are new to exercise, workouts performed in stable conditions is recommended before adding the instability of suspension straps. It may also be a good idea to enlist the guidance of a qualified personal trainer or TRX coach.",
    "benefits": "The TRX biceps curl is an alternative way to build arm and core strength. This classic exercise targets the biceps with shoulders, forearms, and core assisting during the movement. Because TRX involves so many muscle groups for every exercise, it can also benefit your day-to-day life activities. One of the many pros of this method of training is developing a strong core. A stronger core improves posture, helps relieve low back pain, and reduces the risk of injury. This is so important for functional fitness. You not only feel stronger, but you also feel better in general.",
    "instructions": "Attach cables to an anchor point above your head adjusting the straps to hang down about mid-length. Grab the handles and stand with your body facing the anchor point.  Walk your feet toward the anchor point keeping core tight. This places your body slightly leaned back with tension on the cables.  Start with elbows bent higher than your shoulders, palms facing you, and handles toward your forehead. Maintain a strong plank position and slowly lower your body back towards the floor until arms are straight. Slowly bend your arms with control and curl yourself towards the handles to start position.",
    "variations": "The TRX biceps curl can be performed in a variety of ways to accommodate your fitness level. If you are new to TRX training, you may want to apply a few modifications to the biceps curl as follows: Lengthen the suspension straps allowing you to sit on the floor. Maintain the same tight core and cable tension as you perform the biceps curl with increased stability. Stand with staggered feet position to provide more stability during the movement.",
    "precautions": "Workouts performed in unstable conditions require even more core engagement during the exercise. Because of this instability, it’s important to be aware of your body position and movement during TRX training. The following tips will reduce the risk of injury during the TRX biceps curl. Be aware of your body position start to finish. Don’t allow your core to sag during the biceps curl. It’s better to stop and take a rest when you feel fatigued than hurt your back not being able to hold good form. Avoid jerky movements during the biceps curl. If the exercise feels too hard, simply modify the movement to your fitness level.",
    "muscles": "Biceps, core",
    "muscle_img": "https://chunkfitness.com/sites/all/themes/cf2/images/muscle-charts/original/arms.jpg",
    "level": "Advanced"
  },
  {
    "id": 5,
    "name": "Turkish Getup",
    "image": "https://www.verywellfit.com/thmb/o66N-Dbm9xiLpDLrQGOTZixCfDs=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/10-Turkish-Get-Up-GIF-27c5c2d03a6148ba9b9f46ae57c46c46.gif",
    "description": "When it comes to total body training, there are few exercises that target your entire body the way the Turkish getup does. The beauty of this kettlebell exercise, in which you move from a lying position, to a kneeling position, to a standing position, before returning all the way to the floor again, is that it requires you to link separate movement patterns together in a manner that takes you through all three planes of motion—sagittal, transverse, and frontal. This is different from most strength training exercises, which typically utilize only one or two planes of motion, and it ultimately helps build strength in a way that transfers seamlessly to everyday life. Think about it—as you go about your day, you walk, you twist, you bend over, you sit down and stand up, constantly transitioning from one thing to the next without thinking about how your major muscle groups function as a unit to enable these transitions. It's not like your quadriceps live in a bubble where they don't have to coexist and work alongside your other muscles—rather, your quadriceps work with your hamstrings, calves, hip flexors, and your core to perform 'basic' movements like walking. And this concept applies to all movements and all muscles. A well-balanced musculature, strong core, and strong stabilizers at the hips and shoulders all help make you more efficient in everyday movements while reducing the likelihood of injury. Exercises like the Turkish getup not only hit every major muscle group, but they provide a way to 'practice' transitions in a controlled way. This can help you identify and shore up any weaknesses or imbalances that you have while building strength that can transition to functional day-to-day movements and more athletic endeavors. If you're just starting out with the Turkish getup, consider practicing the exercise as part of your warmup routine. Performing just a few repetitions without weight is sure to get your heart rate up while preparing you for the meat of your workout. Once you've mastered proper form and you're ready to start adding more resistance, include getups as part of your regular strength training routine. Start with a lightweight kettlebell and increase resistance as you improve.",
    "benefits": "The Turkish getup really does target almost every major muscle group, and due the to transitions between lying, kneeling, and standing, there's a particularly strong focus on the core and the stabilizing muscles of the hips and shoulders. Two of these transitions require a strong hip hinge, which places a particular focus on the hips, glutes, hamstrings, abs, and low back. The squat and lunge positions target all the major muscle groups of the lower body. And because you're holding a weight over your shoulder, moving through a range of motion while also stabilizing the weight to prevent injury, you engage your shoulder, triceps, upper back, and the small stabilizing muscles of your chest and shoulders. There's a cross-body sling between each hip and the opposite shoulder, and by performing the Turkish getup, which focuses on hitting each shoulder unilaterally while requiring the hips to perform hinges, you have the ability to strengthen this cross-body sling and improve core power and stability. This provides greater core strength and rotational power that can be helpful for twisting movements, especially during athletic activities.",
    "instructions": "Lie on the floor on your right side, your knees bent and your legs stacked, one on top of the other. Hold the kettlebell in both hands directly in front of your chest (elbows bent), your right hand gripping the handle, and your left hand covering your right hand. At this point, you're almost in a fetal position. Roll onto your back, bringing the kettlebell to your chest as you do. Press the kettlebell up into the air as you extend both arms. Bring your right arm perpendicular to the floor, and pull your right shoulder into its socket as you lock out your right elbow. Once the kettlebell is stable and secure, extend your left arm and leg on the ground, angling them roughly 45-degrees from your midline. Your right knee should remain bent with your right foot planted on the floor near your glutes. Take a deep breath and press through your right heel for support as you roll to the left, pressing up onto your left elbow. Exhale, then press all the way up onto your left palm, coming to a seated position, fully extending your left arm as you come to the seated position. As you sit up, the arm supporting the kettlebell should remain fully extended, your humerus 'locked' into the shoulder socket, and the kettlebell always staying perpendicular to the floor. This means as you come to a seated position, your arm moves from a position extended over your chest to a position extended directly over your shoulder.",
    "variations": "Rather than performing the entire Turkish getup, break the exercise into smaller 'bites' and practice each segment individually. For instance, practice moving from the lying position to the kneeling position, then back again. Then practice moving from the kneeling position to the standing position. As you develop greater strength you can start linking the segments together to perform the full getup.",
    "precautions": "The complex nature of this exercise means that there are lots of ways to mess things up and end up getting hurt or exacerbating a previous injury. This is not an exercise for beginners—you need a good baseline level of strength and coordination before adding it to your routine. Consider working with a trainer who is well-versed in the movement to make sure you're performing the exercise correctly. And if at any point you feel sharp or shooting pain, discontinue the exercise or pair it back and work on the segments that don't cause problems. As you get better over time, you may be able to add the elements you couldn't initially perform into your routine.",
    "muscles": "Total body",
    "muscle_img": "https://www.freetrainers.com/redbody/eJzbY2hgYAqFQGAIxiASCkzB2BRJBCoeb2BuCgCLqwxl.png",
    "level": "Advanced"
  },
  {
    "id": 6,
    "name": "TRX Cross Balance Lunge",
    "image": "https://www.verywellfit.com/thmb/p_U38wTPeoAgXBJG62A-B1Ujpdo=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/76-TRX-Cross-Balance-Lunge-GIF-28c9621d77c04320bc3a0bf34fa567d9.gif",
    "description": "The TRX cross balance lunge uses suspension straps and your body weight as an alternative way to perform the basic curtsy lunge. This variation requires you to hold onto handles suspended from an anchor point adding a balance component to the exercise. You are also working each leg independently making it an excellent exercise to build single-leg strength and stability. Suspension cross balance lunges like all TRX exercises work by challenging your body in conditions of instability. This forces you to constantly engage your core to perform each exercise. It also helps improve your balance and overall strength. Because you are suspended during the exercise, it takes the traditional curtsy lunge to a whole new level. The balance component challenges multiple muscle groups and forces more core engagement during the movement. This also means your whole body is working during the cross balance lunge for an effective full-body workout. This is one of the many benefits and allure of TRX training. Some of the muscle groups challenged during the TRX cross balance lunge include the quads, glutes, calves, and core. Working each leg independently also forces the stabilizing muscles to work even harder to keep you balanced. This increased challenge during the exercise helps improve strength, stability, and athletic performance. The TRX suspension straps used during the cross balance lunge and all suspension training exercises are adjustable and suitable for the novice exerciser to advanced athlete. This means the TRX cross balance lunge and all exercises can be modified to suit your fitness level. You may have considered adding suspension training to your workout routine for an added challenge, improved athletic performance, or recommended as a great way to improve single-leg strength and stability. Either way, if you are new to this exercise method, it may be a good idea to enlist the help of a certified TRX coach or a qualified personal trainer.",
    "benefits": "The TRX cross balance lunge provides an increased challenge to the traditional curtsy lunge performed on the floor. It requires more core engagement to balance your body in unstable conditions. Several muscle groups are targeted including: quadriceps, glutes, core and calves. Performing the TRX cross balance lunge is said to be an effective way to build single-leg strength and stability. You are also using dynamic balance which is the ability to maintain control over a base of support while in motion. Your center of gravity is always out of balance during the TRX cross balance lunge leaving no choice but to engage your core, back, hips, and shoulders to stabilize the movement. This creates a more dynamic exercise and enables you to work your full body in just one movement. This exercise's time-saving feature is just one of the many benefits of TRX training.",
    "instructions": "Attach cables to an anchor point above your head adjusting the straps to hang down about mid-length. Grab the handles and stand with your body facing the anchor point. Step back until all slack is removed from the suspension straps, arms extended forward, and palms facing each other. Stand to center the right leg with the TRX anchor point, keeping your core tight, and neutral spine. Extend the left leg behind you and externally rotate the leg as you lower into a lunge so that the left leg crosses behind the right. (left toe gently touches the floor/ground). Press through the right foot to maintain balance during the movement. Drive through the right heel to return to start position. Perform the exercise for a determined amount of reps and repeat on the other leg to complete the cycle.",
    "variations": "If you're new to cross balance lunges and TRX training, you may want to apply a few modifications as follows: Perform the basic curtsy lunge on the floor without suspension straps. This will help you become familiar with the exercise and build leg strength before progressing to the TRX version. Try the TRX basic lunge before progressing to the cross balance variation.",
    "precautions": "The TRX cross balance lunge is performed in unstable conditions and requires keen body awareness during the exercise. Because of this instability, it’s important to be aware of your body position/movement at all times. The following tips will help you perform the cross balance lunge correctly and reduce the risk of injury: Work at your fitness level and range of motion for this exercise to increase overall strength, mobility, and balance before adding more challenge. Maintain proper body alignment during the exercise. This will help keep your knee aligned with your foot and hip of the standing leg. Avoid twisting your hip too much during the TRX cross balance lunge. Externally rotate the hip just enough to cross the leg back behind the standing leg. This will help maintain stability and reduce the risk of injury to your hips/low back. If you experience pain or discomfort that doesn’t feel right during the TRX cross balance lunge, discontinue the exercise.",
    "muscles": "Quadriceps, glutes, calves, core",
    "muscle_img": "https://chunkfitness.com/sites/default/files/lunges-barbell.jpg",
    "level": "Intermediate"
  },
  {
    "id": 7,
    "name": "TRX Sprinter Start",
    "image": "https://www.verywellfit.com/thmb/e4XHdtE2tuly9lzif-NrngVquBo=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/77-TRX-Sprinter-Start-GIF-8bf651f011494ecbbac86af4a2b5857a.gif",
    "description": "The TRX sprinter start uses suspension straps and your body weight to challenge the muscular endurance and power of the quadriceps, hamstrings, and glutes. As you work against handheld resistance, your heart rate also increases for a great cardio workout. If you enjoy sprint intervals or resistance sprints, progressing to the TRX sprinter start will add a whole new dynamic to the exercise. The balance component of suspension straps forces more core engagement during the movement for an increased challenge. If you want to increase the size and strength of your quads and hamstrings, the TRX sprinter start offers an alternative way to achieve that goal. The added bonus is improved core strength and cardiovascular health with this full-body exercise. The TRX sprinter start is an intermediate to advanced exercise so it would be important to master the basic movement before adding knee drives or hops. The good news is all TRX exercises can be modified to your fitness level. You may have considered adding TRX training to your workout routine for an added challenge, improved athletic performance, or recommended as a great way to improve single-leg strength and stability. Either way, if you are new to this exercise method, it may be a good idea to enlist the help of a certified TRX coach or a qualified personal trainer.",
    "benefits": "The TRX sprinter start challenges the muscular power, strength, and endurance of the quadriceps, hamstrings, and glutes. At the same time, you are elevating your heart rate for an effective cardio workout. Because multiple muscle groups are working at the same time, the TRX sprinter start and all suspension training exercises claim to provide a superior timesaving full-body workout. Being able to complete short effective workouts is one of the many benefits of TRX training. Performing the TRX sprinter start is said to be an effective way to build single-leg strength and stability. You are also using dynamic balance which is the ability to maintain control over a base of support while in motion. The balance component of this exercise and other suspension training movements greatly improves stability and neuromuscular response. This comes in handy if you take a misstep off a curb or need to react quickly to a falling object.",
    "instructions": "Attach cables to an anchor point above your head and extend the straps to full length. Face away from the anchor point grabbing the handles at chest level and tucked under the armpits (palms face each other). Lean forward into the TRX straps and walk feet back toward anchor point until your body is straight and at about a 45-degree angle (plank position). Maintain a solid plank position (back straight, core tight, squeeze your glutes) resting on the balls of your feet. Step back with your right leg and into a sprinter start position (like sprinters blocks during a track meet) keeping a 90-degree bend in the knee and stay on the balls of your feet. Drive through the ball of the working leg to return to start position and reset your plank. Continue this movement for a continued amount of reps or timed interval. Repeat the exercise on the other leg.",
    "variations": "If you're new to sprinter starts and TRX training, you may want to apply a few modifications as follows: Master the TRX standing plank position holding the straps tucked near the armpits. This will increase your core strength and exercise confidence before progressing to the next level.  Perform a full incline plank (hands on a bench) and lunge back in stable conditions before adding suspension straps. This will allow you to get comfortable with the exercise as you practice sprint position and returning to plank without having to worry about the balance component.",
    "precautions": "The following tips will help you perform the TRX sprinter start correctly and reduce the risk of injury: Master the basic sprinter start movement before progressing to increased challenge. This includes having the ability to maintain a solid plank position and reset to that position during the exercise. Avoid holding the straps at a half-chest press increasing shoulder stress and instability. Lean fully into the TRX suspension straps held at the armpits to reduce overtaxing the shoulders and to effectively and safely execute the exercise. If you experience pain or discomfort that doesn’t feel right during the TRX sprinter start, discontinue the exercise.",
    "muscles": "Quadriceps, hamstrings, glutes, core",
    "muscle_img": "https://chunkfitness.com/sites/all/themes/cf2/images/muscle-charts/original/legs.jpg",
    "level": "Intermediate"
  },
  {
    "id": 8,
    "name": "TRX Triceps Press",
    "image": "https://www.verywellfit.com/thmb/5IVvFsCDXOfCQ_R3TAGIt26ONrg=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/TRX-Triceps-Press-GIF-1ce61f880acb429282b6c8410a43de4e.gif",
    "description": "The TRX triceps press uses suspension straps and your own bodyweight instead of typical free weights, machines, or cables. The exercise targets your triceps but also challenges the biceps, shoulders, and core as you are suspended from an anchor point.The exercise not only works your triceps but helps to improve your balance and overall strength. Adjusting the level of difficulty for this exercise is an easy shift of your body position and cable angles. The adjustable bands are suitable for the novice exerciser to the advanced athlete and can be modified to fit every fitness level. TRX training claims to provide an effective full-body workout with simple equipment. This is one of the many popular reasons people are trying suspension training. It’s also a great alternative to round out an existing training program.If you’re new to this exercise and TRX training, it’s recommended to perform workouts in stable conditions before adding the instability of suspension straps. It may also be a good idea to enlist the guidance of a qualified personal trainer or TRX coach.The TRX triceps press is an alternative way to build arm and core strength. This exercise targets the triceps but also challenges your biceps, shoulders, and core during the movement. The balance component of this exercise forces you to engage your core to maintain proper body position throughout the movement. Developing a strong core can help improve posture, balance, and relieve low back pain. It also improves the neuromuscular response (reflexes) and stability which can come in handy if you take a misstep off a curb or need to react quickly to a falling object. Performing the TRX triceps press, like all suspension exercises involves multiple muscle groups making it a fast and effective way to get in a full-body workout. Quick and challenging workouts is just one of the many benefits of suspension training.",
    "benefits": "The TRX triceps press is an alternative way to build arm and core strength. This exercise targets the triceps but also challenges your biceps, shoulders, and core during the movement. The balance component of this exercise forces you to engage your core to maintain proper body position throughout the movement. Developing a strong core can help improve posture, balance, and relieve low back pain. It also improves the neuromuscular response (reflexes) and stability which can come in handy if you take a misstep off a curb or need to react quickly to a falling object. Performing the TRX triceps press, like all suspension exercises involves multiple muscle groups making it a fast and effective way to get in a full-body workout. Quick and challenging workouts is just one of the many benefits of suspension training.",
    "instructions": "Attach cables to an anchor point above your head adjusting the straps to hang down about mid-length. Grab the handles and stand with your body facing away from the anchor point. Step forward until all slack is removed from the suspension straps, extend arms overhead and with a 90-degree bend at elbows. Elbows are pointing forward with neutral wrists. Assume a split stance position and lunge forward until straps feel tight (maintain this foot/body position throughout the exercise). Tighten your core, exhale, and extend (straighten) at the elbows pressing your body away from your arms. Upper arms don’t move and elbows continue to point forward away from your body throughout the exercise. Maintain a straight body position during the exercise keeping your head and spine neutral. Avoid sagging or arching your low back/hips. Inhale and with control, slowly lower your body to start position. Repeat the exercise for a determined amount of repetitions.",
    "variations": "If you're new to performing a triceps press and TRX training, you may want to apply a few modifications as follows: Master the triceps press in stable conditions on a bench or standing overhead extension before progressing to the TRX version. This will increase exercise confidence and overall strength before adding the instability of suspension straps. Move your foot stance further away from the anchor point to reduce the difficulty of the exercise. This will allow you to get comfortable with the movement with less bodyweight resistance while increasing overall strength and stability.",
    "precautions": "The following tips will help you perform the TRX triceps press correctly and reduce the risk of injury: Master the basic triceps press on a bench (stable conditions) before progressing to the TRX version. Have the ability to use your core muscles to stabilize your spine before performing this more advanced version of the exercise. Avoid flaring elbows out - keep them pulled into the body at a 90-degree bend for the proper execution of the exercise. Be aware of your body mechanics not allowing hips/low back to sag or arch during the triceps press. If you experience pain or discomfort that doesn’t feel right during the TRX triceps press, discontinue the exercise.",
    "muscles": "Triceps, biceps, shoulders, core",
    "muscle_img": "https://chunkfitness.com/sites/default/files/overhead-extensions-barbell.jpg",
    "level": "Intermediate"
  },
  {
    "id": 9,
    "name": "Dead Bug",
    "image": "https://www.verywellfit.com/thmb/FJEoedLRiJMbIdRuOPvu8ycwBTA=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/105-Dead-Bug-ExerciseGIF-407d0bbb6d8742be855b219e74c18bd0.gif",
    "description": "When you think about core or abdominal exercises, you probably think about exercises like sit-ups, crunches, reverse crunches, or even Russian twists—exercises that involve flexion or rotation of the abdomen as you move through a range of motion. The popular argument is that these exercises 'carve' the core and give you the six-pack look you're going for. And while, certainly, they can help with strengthening the rectus abdominis and obliques—more of the 'show me' muscles of the stomach—it's every bit as important (if not more so) to strengthen the deep muscles of your core, including the spinal erectors and transverse abdominis. You can do this by adding stabilization exercises like the dead bug to your regular strength training routine. Here's the thing: the 'dead bug' sounds like a gross or weird exercise. It's really not. It's a straightforward movement you do while lying on your back. As you keep your torso still and your core tight, you extend and retract opposing extremities, preventing your low back from arching off the floor or your hips or shoulders from rocking back-and-forth. And as a beginner exercise, you need next to nothing to get started. It's a bodyweight movement that uses nothing more than a yoga mat. Simply add it to your typical core-training routine, or after a cardio exercise session. When you think of abdominal work, you probably think of working your abs for the purpose of looking good in a swimsuit. But your abs are a key component of your total core musculature, which actually includes all the muscle groups spanning between your hips and your shoulders. These muscles work together to transfer movement between your upper and lower body, and they help stabilize the spine, preventing your spine from moving in ways it shouldn't. As a result, a strong, stable core helps to promote coordinated, athletic movement while simultaneously protecting your lower back from injury. The dead bug is an excellent exercise for promoting total core stability while improving contra-lateral limb engagement. This basically means the exercise helps teach you to effectively move opposing limbs in tandem while keeping your core stable and your back protected. Think for a second about sports like tennis or basketball—how athletes need to extend opposing limbs as they jump, stretch, or reach for the ball. A strong, stable core makes these types of movements possible. But it's not just athletes who need this type of back-protecting core stabilization. Anyone who's ever accidentally tripped on a rough sidewalk or been knocked off-balance after knocking into a misplaced chair knows that it doesn't take much to lose control of your core. The dead bug is a beginner-friendly movement that helps you grow accustomed to contra-lateral limb extension while keeping your core stable and protected. Performed correctly, the dead bug encourages the deep, stabilizing muscles of your low back, abdominals, and hips to engage, preventing your back from twisting or arching during the exercise. You'll end up improving side-to-side coordination that can effectively transfer to athletic performance, while also improving deep core strength that can reduce the risk of low-back injury. The dead bug is also an excellent option for individuals who aren't quite ready for the more well-known plank exercise. Both movements are designed to help promote core stabilization, but the plank can be challenging for individuals without much core strength, or those who have low back pain. The dead bug can help improve the core stabilization necessary to do the plank while simultaneously adding the challenge of contra-lateral limb movement to the mix.",
    "benefits": "When you think of abdominal work, you probably think of working your abs for the purpose of looking good in a swimsuit. But your abs are a key component of your total core musculature, which actually includes all the muscle groups spanning between your hips and your shoulders. These muscles work together to transfer movement between your upper and lower body, and they help stabilize the spine, preventing your spine from moving in ways it shouldn't. As a result, a strong, stable core helps to promote coordinated, athletic movement while simultaneously protecting your lower back from injury. The dead bug is an excellent exercise for promoting total core stability while improving contra-lateral limb engagement. This basically means the exercise helps teach you to effectively move opposing limbs in tandem while keeping your core stable and your back protected. Think for a second about sports like tennis or basketball—how athletes need to extend opposing limbs as they jump, stretch, or reach for the ball. A strong, stable core makes these types of movements possible. But it's not just athletes who need this type of back-protecting core stabilization. Anyone who's ever accidentally tripped on a rough sidewalk or been knocked off-balance after knocking into a misplaced chair knows that it doesn't take much to lose control of your core.",
    "instructions": "Lie on the mat with your arms extended straight over your chest so they form a perpendicular angle with your torso. Bend your hips and knees 90-degrees, lifting your feet from the ground. Your torso and thighs should form a right angle, as should your thighs and shins. This is the starting position. Engage your core, maintaining contact between your lower back and the mat. You want to make sure your spine maintains this steady and neutral position throughout the exercise. Keep your right arm and left leg exactly where they are, then slowly reach your left arm backward, over your head and toward the floor as you simultaneously extend your right knee and hip, reaching your right heel toward the floor. Move slowly and steadily, breathing in as you perform the extensions, avoiding any twisting or movement of your hips and abs. Stop the movement just before your arm and leg touch the ground. Reverse the movement and return your left arm and right leg to their starting positions. Move slowly and steadily, exhaling as you go. Perform the same movements to the opposite sides, this time keeping your left arm and right leg steady as you extend your right arm and left leg. Do the same number of repetitions on each side. When you complete a full set, simply return your feet to the ground and sit up.",
    "variations": "The dead bug exercise itself is a fairly beginner-friendly movement, but anyone with weak core stabilizers may find themselves struggling with proper form. If you can't seem to keep your torso steady as you do the dead bug, the best modification is to move one extremity at a time, rather than moving opposing arms and legs. Instead of extending your right arm and left leg simultaneously, try extending your right arm by itself. After you bring it back to center, extend your left leg. After you bring your left leg back to center, do the same thing with your left arm and right leg. When you feel you're able to successfully move each extremity independently, try the opposite arm-opposite leg challenge again, but adjust the range of motion accordingly, stopping your extensions when you feel your torso shift or your low back arch off the floor.",
    "precautions": "Overall, the dead bug is a safe exercise for most individuals. As with any strengthening movement, the primary risk of injury takes place when you sacrifice proper form in an effort to 'gut out' a series of repetitions. Just remember, that's your ego talking. If your form starts to suffer, it's likely because your muscles are tired and it's time to wrap up your set. Doing more repetitions with poor form won't help your efforts to get stronger, and may, in fact, lead to injury, particularly of the low back. First and foremost, slow down and pay attention to form—make sure your low back isn't arching and your torso isn't rocking back and forth as you move. Second, if you have a known low-back injury, don't push yourself to perform the movement if it causes pain. Muscle soreness or fatigue is one thing, but sharp or jabbing pains, or any type of discomfort that makes you think,'I won't be able to move tomorrow,' is what you want to avoid. Talk to a trainer or physical therapist for options if the dead bug simply isn't working for you.",
    "muscles": "Core,abdominis, spinal erectors",
    "muscle_img": "https://chunkfitness.com/sites/all/themes/cf2/images/muscle-charts/original/abs.jpg",
    "level": "Beginner"
  },
  {
    "id": 10,
    "name": "Inchworm",
    "image": "https://www.verywellfit.com/thmb/FUPdmTiizCMcw9XANXp6SUU9n-M=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/73--InchwormGIF-9a268be275804d59b0c34b9d357d6015.gif",
    "description": "The inchworm exercise offers a little bit of everything—it helps strengthen the muscles of your anterior chain (the front half of your body), while stretching the muscles of your posterior chain (the back half of your body). And because it targets your entire body in some capacity, it gets the blood flowing. This makes it an excellent move to incorporate into an active warm-up before a strength training or high-intensity interval training routine. The movement itself ends up looking exactly like its name—an inchworm. You start standing, reach your arms down toward the ground, walk your hands away from your feet, entering a plank-like position, before stepping your feet forward toward your hands and finally returning to a standing position. You then continue the worm-like crawl for time or repetitions. The inchworm exercise is a solid movement to add to just about any routine. Because it has the ability to strengthen and stretch different muscle groups at the same time, it's ideally positioned to be included as part of an active warm-up, or as part of a high-intensity interval training routine. The strengthening part of the movement comes when you're entering, exiting, and holding the plank portion of the movement. As you step your hands forward, away from your feet, your shoulders, triceps, chest, and eventually your abdominals, the stabilizing muscles of your shoulders and hips, your glutes, and your quadriceps all engage to support your body's weight as you enter the plank. Likewise, if you're doing a high-intensity interval training routine, you can use the inchworm as part of your 'rest' intervals to keep your heart rate up while giving your cardiovascular system a bit of a break. The stretching part of the movement is particularly apparent as you reach your hands toward the floor and start walking them forward, and again as you walk your feet forward toward your hands. You'll feel the stretch through your hamstrings and calves, in particular, and might also feel a slight stretch through your glutes and low back. Also, if you perform the more challenging version of the exercise, you may experience a slight stretch through your shoulders and chest as you walk your hands forward past the full-plank position into an extended plank. Again, incorporating the inchworm into an active warm-up is a great way to fluidly stretch the muscle groups you plan to target during your workout without performing static stretching. If you're unfamiliar with the concept of an active warm-up, and why it's beneficial, the idea is to mentally and physically prepare your body for whatever workout you're about to take on. So, for instance, if you're planning on doing a lower-body strength training routine, an active warm-up would include exercises that hit the same muscle groups in the same general way as the exercises you're going to perform during your workout, but without using added resistance. Active warm-ups are also designed to stretch the muscle groups you're going to target without holding a stretch for a set period of time. This type of warm-up greases the wheels for your workout and helps prevent injuries. An exercise like the inchworm is ideal because it uses only your bodyweight to target just about every major muscle group. Try incorporating it with air squats, lunges, high knees, and lateral slides before your next strength training routine.",
    "benefits": "The inchworm exercise is a solid movement to add to just about any routine. Because it has the ability to strengthen and stretch different muscle groups at the same time, it's ideally positioned to be included as part of an active warm-up, or as part of a high-intensity interval training routine. The strengthening part of the movement comes when you're entering, exiting, and holding the plank portion of the movement. As you step your hands forward, away from your feet, your shoulders, triceps, chest, and eventually your abdominals, the stabilizing muscles of your shoulders and hips, your glutes, and your quadriceps all engage to support your body's weight as you enter the plank.",
    "instructions": "Stand tall, your feet roughly hip-distance apart. Check your posture—your ears should be aligned over your shoulders, hips, knees, and ankles, your abdominals engaged. Take a breath in, then as you exhale, look down at the ground and start reaching your hands toward the floor in front of your feet, allowing your back to bend forward, rolling down one vertebra at a time. Allow your knees to bend slightly, as needed, to enable your hands to reach the ground. Place your hands on the floor in front of your feet. Inhale and walk your hands forward, one at a time, allowing your heels to lift off the floor as your body begins to straighten. When your hands are directly under your shoulders, check your form—you should be in a full plank position with your core, chest, quads, triceps, and shoulders engaged, your body forming a straight line from heels to head. Keep your legs relatively straight and begin walking your feet forward, one at a time, toward your hands. This should provide a nice stretch through your hamstrings, calves, and glutes as your hips start lifting toward the ceiling. Exhale as you step forward. Stop when your feet are as close to your hands as you can comfortably bring them. Remember, you can bend your knees slightly to ease the stretch on your hamstrings, but try to keep them as straight as possible. Return to standing by slowly rolling your back up from the hips, straightening one vertebra at a time. Inhale as you go. When you're back in the starting position, you've completed one repetition. Continue for time or repetitions, depending on your workout.",
    "variations": "To perform the modification, stand tall and start the exercise just as you normally would—roll your back and torso forward as you reach your hands to the ground. Step your hands forward until you enter a high plank position, checking to make sure your core remains engaged. When you enter the full plank, instead of stepping your feet forward toward your hands, simply reverse the movement and walk your hands backward toward your feet. When you've walked them back as far as you comfortably can, use your core and roll your back carefully up to standing. Continue the exercise for time or repetitions.",
    "precautions": "Generally speaking, the inchworm is a safe exercise for most people, especially when performed in a controlled, steady manner. That said, anyone with tight hamstrings, wrist pain, or shoulder pain, may find the exercise uncomfortable to perform. If you try the movement and it causes pain, stop the exercise and opt instead for other active warm-up exercises like walking lunges, air squats, or steadily moving between a plank and downward dog.",
    "muscles": "Total Body",
    "muscle_img": "https://www.freetrainers.com/redbody/eJzbY2hgYAqFQGAIxiASCkzB2BRJBCoeb2BuCgCLqwxl.png",
    "level": "Beginner"
  },
  {
    "id": 11,
    "name": "Single Leg Bridge",
    "image": "https://www.verywellfit.com/thmb/PIjm3PNkLeD1PlO5l5tD5SK5gOU=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/101-3120739-Single-leg-Bridge-GIF-9237b401070f445b8868ca589dde216e.gif",
    "description": "The single leg bridge exercise is a great way to isolate and strengthen the gluteus (butt) muscles and hamstrings (back of the upper leg). If you do this exercise correctly, you will also find that it is a very powerful core strengthening technique. Add this exercise to your regular workout routine to wake up and tone your buttocks.",
    "benefits": "Athletes need strong butt muscles for running and jumping. The single leg bridge makes the list of the best butt exercises for athletes. It's considered to be a good toning exercise to sculpt your buttocks. Even if you're not competing, everyone could use more glute activation to counter time spent sitting. In order to hold the pelvis level throughout the exercise, you need to contract both the abdominal and lower back muscles. This will help stabilize your spine. Use this exercise for a unique twist on the traditional core and abdominal strengthening exercises.",
    "instructions": "Lay on your back with your hands by your sides, your knees bent and feet flat on the floor. Make sure your feet are under your knees. Tighten your abdominal and buttock muscles. Raise your hips up to create a straight line from your knees to shoulders. Squeeze your core and try to pull your belly button back toward your spine. Slowly raise and extend one leg while keeping your pelvis raised and level. Hold. Return to the starting position with knees bent. Perform the lift with the other leg.",
    "variations": "The goal is to maintain a straight line from your shoulders to your extended leg and hold for 20 to 30 seconds. You may need to begin by holding this bridge position for a few seconds and switching sides. It's better to hold the correct position for a shorter time than to go longer in the incorrect position. If you can't hold this position, begin with the basic bridge exercise to build strength and then progress to the one-leg bridge. In the basic bridge, you keep both feet on the ground while performing the same move. It is considered to be a basic rehabilitation exercise for spinal and core stabilization.",
    "precautions": "The bridge and its variations are often used in physical therapy, but if you have any injuries to your neck, back, or ankle, you should talk to your doctor or therapist to see if this exercise is appropriate for you. This exercise is in a supine position and may be one to avoid during the second and third trimester of pregnancy.",
    "muscles": "Gluteus maximus, hamstrings",
    "muscle_img": "https://chunkfitness.com/sites/all/themes/cf2/images/muscle-charts/original/legs.jpg",
    "level": "Beginner"
  },
  {
    "id": 12,
    "name": "Pushups",
    "image": "https://www.verywellfit.com/thmb/WEMOE5Z79lFIOOwPfgHljmF1aao=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Verywell-42-3498282-Pushup01-1596-5994a0f8519de20010b3bdd3.gif",
    "description": "The pushup may just be the perfect exercise that builds both upper-body and core strength. Done properly, it is a compound exercise that uses muscles in the chest, shoulders, triceps, back, abs, and even the legs. It has many modifications so beginners can start with easier versions and work up to the standard pushup, while you can find a challenging variation if you are advanced. You can do the pushup as part of a bodyweight exercise session, a circuit training workout, or a strength workout.",
    "benefits": "The upper body muscles that come into play in the pushup are the deltoids of the shoulders, the pectoral muscles of the chest, the triceps and biceps of the upper arm, and the erector spinae of the back. The abdominal muscles used to hold the body rigid during the pushup are the rectus abdominis and the transversus abdominis. As the pushup involves multiple joints, it is a compound exercise. In daily life, you will often need to push against objects, from doors to shopping carts. The functional fitness you develop with pushups will serve you well. Working the stabilizer muscles around the shoulders can help protect you from rotator cuff injuries. Pushups are also a measure of overall fitness, allowing you to assess whether you need to be doing more to keep your body in good working condition.",
    "instructions": "Get on the floor on all fours, positioning your hands slightly wider than your shoulders. Extend your legs back so that you are balanced on your hands and toes. Keep your body in a straight line from head to toe without sagging in the middle or arching your back. You can position your feet to be close together or a bit wider depending on what is most comfortable for you. Before you begin any movement, contract your abs and tighten your core by pulling your belly button toward your spine. Keep a tight core throughout the entire pushup. Inhale as you slowly bend your elbows and lower yourself until your elbows are at a 90-degree angle. Exhale as you begin contracting your chest muscles and pushing back up through your hands to the start position. Don't lock out the elbows; keep them slightly bent.",
    "variations": "Try these variations if you need less difficulty: Incline Pushups: If a standard pushup is too difficult, you can start by doing pushups against a table or bench. Stand several feet away from the object. Use the same pushup technique as above to lower yourself until the elbows are 90 degrees, then raise back up. Keep your core tight the whole time. Bent-Knee Pushups: This is a modified version of the standard pushup performed on the knees rather than on the toes. Be sure to keep the knees, hips, and shoulders all in a straight line. Do not allow yourself to bend at the hips.",
    "precautions": "You should not do pushups if you have a shoulder, wrist, or elbow injury. Talk to your doctor or physical therapist to see if this is an appropriate exercise. If you want to protect your wrists, you can place your hands on dumbbells or pushup bars to keep them in a neutral position. If you feel shoulder pain during the pushup or hear a clicking noise in your shoulder, end the exercise.",
    "muscles": "Chest, arms, shoulders, core",
    "muscle_img": "https://chunkfitness.com/sites/default/files/push-ups-calisthenics.jpg",
    "level": "Advanced"
  },
  {
    "id": 13,
    "name": "Ball Pushup",
    "image": "https://www.verywellfit.com/thmb/unQyfq80J28FBs6bwv5KXe6tP2Q=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/37-3120145-Stability-Ball-Pushup-GIF-cb05e8632dcf4f9cb49503cb2d27856c.gif",
    "description": "If you want to move beyond the basic pushup or the plank on a stability ball to build upper body strength and control, try stability ball pushups. You're probably familiar with the stability ball, though you may know it by another of its many names, like Swiss ball, exercise ball, or balance ball. This variation of the pushup is both more difficult and more effective than the standard floor pushup. The stability pushup can be used as part of a total body strengthening routine.",
    "benefits": "Like standard pushups, this exercise works your chest and shoulder muscles. In addition, you activate twice the number of core muscles when you perform exercises like the plank and pushup on an unstable surface like the stability ball. The pushup is a functional exercise using your body as resistance instead of weights. Such exercises require more muscles to be activated (stabilizer muscles and core muscles) during the movement. In this way, a pushup works more muscles than a bench press. When you add in the requirement of balance, you also increase muscle fiber activation. This exercise is also good for shoulder stabilization.",
    "instructions": "Lay with your chest on the stability ball. Place your hands on the ball at the sides of your chest. They will be shoulder-width apart. Place your toes on the floor, legs straight. Push your body up until your arms are almost straight (do not lock your elbows). Hold and balance for two seconds. Slowly return to the starting position and repeat.",
    "variations": "This exercise can be done in different ways to match your level of fitness. If you are having difficulty with doing the pushup with a straight body alignment, try the kneeling version. Kneel but keep your torso and hips in a straight line while doing the pushup.",
    "precautions": "You should not do pushups if you have a shoulder injury. End the exercise if you feel any shoulder pain or hear a clicking noise in your shoulder Use caution if you have any wrist or elbow injury. Talk to your doctor or physical therapist to see if this is an appropriate exercise.",
    "muscles": "Chest, shoulders",
    "muscle_img": "https://chunkfitness.com/sites/default/files/push-up-bosu-ball.jpg",
    "level": "Intermediate"
  },
  {
    "id": 14,
    "name": "TRX Mountain Climbers",
    "image": "https://www.verywellfit.com/thmb/Rj_0eWVK2X_j6HCbDUWe29roSu0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/74-TRX-Mountain-Climbers-GIF-24a7ab5f524b47ca8d635d5afdef097a.gif",
    "description": "The TRX mountain climber uses suspension straps and your body weight as an alternative way to perform the basic mountain climber. Instead of doing running planks on the floor, you are suspended from an anchor point at the feet and performing a running movement in the air. The exercise also requires you to balance on your hands while suspended. Suspension mountain climbers, like all TRX exercises, work by challenging your body in conditions of instability. This forces you to constantly engage your core to perform each exercise. It also helps improve your balance and overall strength. Because you are suspended during the exercise, it takes the traditional mountain climber to a whole new level. The balance component challenges multiple muscle groups, especially your core during the movement. It’s said to be an effective full-body workout as nearly every muscle group is firing while you work. Some of the muscle groups challenged during the TRX mountain climber include the core, quads, hip flexors, hamstrings, shoulders, and arms. Your heart rate also increases as a response to the exercise intensity. Because the exercise is working almost the entire body, it is said to be a great way to improve overall strength and cardiovascular health.",
    "benefits": "The TRX mountain climber provides an increased challenge to the traditional mountain climber performed on the floor. It requires more core engagement to balance your body in unstable conditions. Nearly all muscle groups are targeted including: quadriceps, hip flexors, abdominals/core, hamstrings, shoulder muscles, biceps/triceps, heart muscle. Your center of gravity is always out of balance during the TRX mountain climber leaving no choice but to engage your core, back, hips, and shoulders to stabilize the movement. This creates a more dynamic exercise and enables you to work your full body in just one movement. This exercise time-saving feature is just one of the many benefits of TRX training.",
    "instructions": "Attach cables to an anchor point above your head adjusting the straps to hang down about six inches from the floor or ground. Place your feet in the straps and walk out into a full plank position. Maintain a tight core, straight back, and keep hips tucked under to prevent your back from arching. Bring the right knee toward your chest keeping the left leg extended. Switch legs by quickly bringing the left knee toward your chest and extending the right leg. Alternate the right and left knee to chest movement for a determined amount of reps or timed interval.",
    "variations": "If you're new to mountain climbers and TRX training, you may want to apply a few modifications as follows: Perform mountain climbers on the floor before adding suspension straps. This will allow you to get comfortable with the movement before introducing unstable conditions. As you gain confidence with the basic mountain climber, you will soon be ready to progress to the TRX version. Hold a plank position with your feet in the suspension straps without alternating the knee towards the chest. This will introduce you to the unstable conditions from suspension straps and build up your core strength.",
    "precautions": "The following tips will help you perform the TRX mountain climbers correctly and reduce the risk of injury: Take the time to properly adjust your suspension straps about six inches from the floor and that both straps are at equal lengths. Maintain a tight core and straight back at all times during the exercise to reduce the risk of low back discomfort/injury. Be aware of any sag in your hips or arched back during the exercise. This could be an indicator of being tired, fatigued, or not enough core strength to perform the movement. Work at your fitness level for this exercise to increase overall strength and balance before adding more challenge. If you experience pain or discomfort that doesn’t feel right during the TRX mountain climber, discontinue the exercise.",
    "muscles": "Core, quadriceps, hip flexors",
    "muscle_img": "https://chunkfitness.com/sites/default/files/mountain-climbers-flat-surface_0.jpg",
    "level": "Intermediate"
  },
  {
    "id": 15,
    "name": "TRX Golf Swing",
    "image": "https://www.verywellfit.com/thmb/_vGjfFMutOFoj7fU-fxrkJnLlu4=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/71-4685503-TRX-Golf-Swing-GIF-resize-007867dbdf164939852f0e8ee6a4404b.gif",
    "description": "Ask any golfer what their number one challenge is, and there’s a good chance they’ll say their swing. Makes sense, right? After all, it’s the swing mechanics that dictate how hard you’ll hit the ball, how far, and definitely how straight it will go. The TRX golf swing exercise engages and strengthens the muscles needed for stability, which will help keep you connected to the ground so you can hit the ball farther with better consistency. While the TRX golf swing is designed to take your body through the foundational moves of a basic golf swing, it is not an exact replica of your actual swing. The TRX suspension trainer will help you to engage muscles used in key golf movement patterns while training your shoulder girdle to fully rotate with strength and ease. The suspension cables also create an environment of instability that requires you to recruit your core muscles to perform the move properly and stay connected to the ground.",
    "benefits": "The TRX golf swing specifically targets the shoulders, upper back, and core muscles throughout the entire movement. The muscles of the lower body—the quads, glutes, and hamstrings—play a role in balance and stability, especially during the rotational phase of the exercise. Your core muscles are involved in most, if not all, of the movements you perform daily. This includes day-to-day activities, exercises in the gym or during athletic events, and basic movements such as rotation, flexion, and extension, which explains why they play such a significant role in golf swing mechanics. Practicing the movement pattern of the TRX golf swing can help you develop a better range of motion, primarily through the upper thoracic spine, shoulders, hips, and ankles. Additionally, the TRX golf swing can help strengthen your core which may lead to reduced back pain, improved balance, and better flexion, extension, and rotation of your trunk. Stronger core muscles can also boost your fitness and athletic performance.",
    "instructions": "Start by standing in front of a set of TRX straps. They should be attached to an anchor point above your head. Shorten the straps as much as you can. You'll want to make sure to maintain tension in the straps the entire time. Grasp the handles just like you would your golf club. Left hand and left palm faces down and right palm faces up. Take a step out to the side until your feet are wider than shoulder-width apart, with a slight bend in your knees. This helps create a solid base for the movement. Extend your arms straight out in front of you. They should be slightly lower than chest height. This helps to engage the muscles in the movement pattern that will help you be successful in your golf swing, but it does not exactly replicate the motion of your swing. Put tension down in the straps with both hands and start to rotate to the top of the golf swing movement. Focus on getting a full shoulder turn. Keep your head looking down as if you have your eyes on the ball. At the top of the movement, your arms should look like they do when you’re getting ready for the downswing. Start the downswing with the lower body. Make sure your base is stable, so you stay connected to the ground. Your upper body will follow and “swing” the TRX straps toward the other side of your body. This puts your body in a position of power as you move toward the impact position. Pause, then return the straps and body to the starting position (the middle). ",
    "variations": "If you don’t have access to a set of TRX straps, no problem. Thick, long resistance bands and loops work great as a modification for this exercise. Anchor them like you would the TRX straps, but rather than putting your hands in a set of handles, you grasp the loop. Follow the same instructions: keeping tension in the resistance bands, eyes down like you’re looking at the ball, and rotating back to the top of your swing. Pause and continue through the downswing portion of the movement. ",
    "precautions": "Being able to execute this movement properly requires flexibility and mobility in your hips and shoulders. If you have any limitations or physical conditions that prevent you from rotating, consider talking with a personal trainer or physical therapist. They can watch you perform the exercise to ensure you can execute it with proper form. If you feel back pain or shoulder and upper body pain during any part of this movement, stop what you’re doing and check your form. You may need to modify or decrease how far you rotate until you have enough mobility and flexibility to handle the full movement. If the pain continues, discontinue the exercise and talk with your doctor or a physical therapist before trying it again. ",
    "muscles": "Shoulders, upper back, core muscles, obliques, erector spinae (lower back)",
    "muscle_img": "https://chunkfitness.com/exercises/back-exercises/outer-back-exercises/external-arm-rotations-cable",
    "level": "Intermediate"
  },
  {
    "id": 16,
    "name": "Leg Curls",
    "image": "https://www.verywellfit.com/thmb/LknrlOGHUVzaAaGtrNhJM7tXDd8=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/45-3498304-Leg-Curls-GIF-aa13a58de5a744719617eb7155357877.gif",
    "description": "The leg curl is a basic isolation exercise the targets two primary muscle groups: the calf muscles (gastrocnemius and soleus muscles) and the hamstrings (the biceps femoris, semitendinosus, and semimembranosus muscles). Leg curls are performed on a gym bench with a levered lifting bar at the foot end of the machine. The classic version of the exercise is done lying flat on your stomach with your ankles tucked under a padded roller.",
    "benefits": "While the primary benefits of leg curls are strengthening and improving flexibility in your hamstrings, the exercise also targets other muscle groups. To do a leg curl, you pull your heels toward your buttocks from your position on the machine (either seated or prone). This movement will smoothly pull the weights that are connected to the machine's pulley system. As you lower your feet back down, the resistance shifts slightly, which works your buttocks (gluteus muscles), thighs (quadriceps), and the front of the shins (tibialis anterior). Having strong, flexible hamstrings is an important factor in your overall strength, balance, and stamina. Hamstrings that can withstand the demands of your workout aren't just helpful when you're at the gym, however. Their strength will also help you avoid injury as you go about your day-to-day life. Good posture and balance protect your muscles as you do everything from play with your kids to household chores. Overall strength and flexibility in these key muscle groups will also help you as your body ages, especially if you are prone to knee problems, joint, or back pain. When leg curls are part of your overall strength training, you are also contributing to improved cardiovascular strength and weight management, both of which are factors that can reduce and help prevent chronic pain.",
    "instructions": "Start by lying flat on your stomach. Adjust the roller pad so that it rests comfortably a few inches under your calves, just above the heels. Check to make sure the pads aren't too high up on your calves as this can place pressure on your Achilles tendon and reduce your range of motion. Stretch your legs out fully. On an inhale, lightly grasp the support handles on each side of the machine. Lift your feet smoothly as you exhale, keeping your hips firmly on the bench. Inhale as you flex your knees and pull your ankles as close to your buttocks as you can. Hold this position for a beat, allowing yourself to make sure you are focused as you prepare to lower your legs. Inhale fully as you return your feet to starting position in a smooth, slow, controlled movement. Repeat for 8 to 12 reps.",
    "variations": "Depending on what's available at your gym, you may be able to avoid lower back strain by using a newer ergonomic machine.2﻿ Many leg curl machine models now place your hips in a bent position to reduce pressure on your lower back. Most machines allow you to perform leg curls lying or seated. You may prefer the seated leg curl variation if it is uncomfortable for you to be in a prone position. The other benefit to seated leg curls is having the bar rest on your upper thighs, which prevents you from lifting your legs as you curl. When you are doing leg curls in the prone position, you have to work a little harder to keep your hips against the bench. Seated leg curls are generally a better option if you have lower back pain or neck pain, as this position provides support and prevents overextension.",
    "precautions": "Bodybuilders use hamstring curls to increase muscle mass. However, fitness pros and athletes who play certain sports don't always favor the exercise as it can cause the foreshortening (or tightening) of the hamstrings. If you overtrain and fail to stretch properly, repeated contraction and muscle growth can impair hamstring flexibility. To keep your hamstrings limber, always do stretches after a workout. In some cases, you may want to avoid leg curls. If you're recovering from illness, injury, or surgery, the exercise may exacerbate an existing problem, slow healing, or put you at risk for increased pain. You may want to avoid leg curls if you: have injuries or instability in your knee, have recently had knee or hip surgery, are recovering from injury or surgery involving your back, spine, or neck, have ruptured or torn ligaments in your knee or ankle, such as your Achilles tendon or anterior cruciate ligament (ACL).",
    "muscles": "Hamstrings, calf muscles, glutes, quads, shins",
    "muscle_img": "https://chunkfitness.com/sites/default/files/lying-leg-curls-machine_0.jpg",
    "level": "Intermediate"
  },
  {
    "id": 17,
    "name": "Incline Dumbbell Press",
    "image": "https://www.verywellfit.com/thmb/qNXStexc84q69N8Nzie2q0a1cuA=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/66-4588212-Incline-Dumbbell-Press-GIF-cc6b35c8cecc4b808532c881732bf3f0.gif",
    "description": "The incline dumbbell press is a free weight exercise designed to target the chest, shoulders, and triceps, hitting each side of the body independently. Unlike the more traditional flat bench press, the incline press shifts the focus of the movement to the upper portion of the pectoral muscle groups and the front of the shoulder. This allows for greater hypertrophy (muscle growth) of the upper chest when the exercise is performed regularly. The incline dumbbell press is designed to increase chest strength and size, so it's typically included in a well-rounded, intermediate strength training program. If you split up your weekly workouts by body part, include this chest exercise on your upper body or chest day, after exercises like pushups or the flat bench press.",
    "benefits": "The dumbbell incline press targets the upper portion of the chest—specifically, the clavicular head of the pectoralis major—an area of the chest that's almost completely unengaged during other common chest exercises, like the traditional bench press, incline pushups, and chest fly. The incline press also hits the anterior head of the deltoid muscle of the shoulders, or the front part of your shoulder. Functionally, the dumbbell incline press transfers naturally to a range of pushing and pressing motions, such as pushing open a heavy door or putting groceries away on elevated shelves. The dumbbell version of the incline press is especially beneficial for correcting strength imbalances between each side of your body. It's common for one arm to be stronger than the other. By using dumbbells to perform this exercise, each arm works independently, which prevents the dominant arm from 'taking over' to perform the lift, improving strength and stability on both sides of the body.",
    "instructions": "Sit on the bench and lean back. Hold a dumbbell in each hand, with hands positioned at your shoulders, elbows bent and angled down below your ribs. Relax your neck against the bench. Keep your feet flat on the floor. Brace your core and press both dumbbells straight up over your chest as you exhale. Keep your wrists straight (don't let them 'cock' backward). At the top of the movement, the dumbbells should almost touch each other and your arms should be perpendicular to the floor. Reverse the movement and slowly lower the dumbbells back to the top of your chest as you inhale. As you lower the dumbbells, your elbows should come down at roughly a 45-degree angle to your torso. They shouldn't splay out to the sides, pointing toward the side of the room. Instead, keep your elbows pointing to the floor. Aim to complete sets of 8 to 12 reps. Start with one set and work up to two to three sets over time as you build strength. When you finish your set, safely exit the exercise by sitting up and placing the dumbbells on your knees before you stand up. Avoid dropping the dumbbells while you're lying on the incline bench.",
    "variations": "If using dumbbells or isolating each shoulder independently doesn't work for you, you can modify the exercise and still get similar results. Instead of the dumbbell incline press, opt for the barbell incline press. The barbell exercise targets the same muscle groups in the same way but doesn't require the unilateral control that the dumbbell press requires. This exercise will help you develop the baseline strength required for the movement while also starting to engage the stabilizing muscles of the shoulders without isolating each shoulder independently. Perform the exercise in the exact same way as the dumbbell press, except use a barbell gripped with both arms instead of individual dumbbells.",
    "precautions": "The most important thing to remember when performing the incline dumbbell press is to select an appropriate weight for your strength level, which is probably less than you think. You should be able to complete between 8 and 12 repetitions with the weight you select for a typical workout routine. The dumbbell incline press is generally a safe exercise, but it does require a baseline level of strength, and it shouldn't be attempted if you're brand-new to strength training. In that case, start with machine weights or a barbell incline press to grow accustomed to the movement, then move on to the incline dumbbell press once your ready. The incline press can be problematic for those who experience shoulder pain. If you have ongoing shoulder pain, attempt the exercise on a machine or with a barbell before trying it with dumbbells. If you experience sharp or shooting pain at any point during the exercise, stop and opt for exercises that don't cause pain.",
    "muscles": "Chest, shoulders, triceps",
    "muscle_img": "https://chunkfitness.com/sites/default/files/incline-presses-dumbbell_1.jpg",
    "level": "Intermediate"
  },
  {
    "id": 18,
    "name": "Leg Extensions",
    "image": "https://www.verywellfit.com/thmb/cSN6yffrvkH9ShEGqtvOpmefO1k=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/44-3498573-Leg-Extension-GIF-369e8d86622b4313b74baf12a03afc46.gif",
    "description": "Leg extensions are exercises usually done with a lever machine. You sit on a padded seat and raise a padded bar with your legs. The exercise works mainly the quadriceps muscles of the front of the thigh—the rectus femoris and the vastus muscles. You can use this exercise to build lower body strength and muscle definition as part of a strength training workout.",
    "benefits": "The leg extension targets the quadriceps, which are the large muscles of the front of the thigh. Technically, this is an 'open chain kinetic' exercise, which is different from a 'closed chain kinetic exercise,' such as a squat. The difference is that in the squat, the body part you're exercising is anchored (feet on the ground), while in the leg extension, you're moving the padded bar, which means your legs aren't stationary as they work, and thus the chain of movement is open in the leg extension. The quads are well-developed in cycling, but if your cardio is running or walking you are mostly exercising the hamstrings at the back of the thigh. In this case, you may want to develop the quads to be more in balance. Building your quads can also increase the force of kicking movements, which can be beneficial in sports such as soccer or martial arts.",
    "instructions": "Set up the leg extension machine so the pad is at the top of your lower legs at the ankles. Your knees are at 90 degrees. Select a weight that will give you a moderate load for 10 to 12 repetitions. Place your hands on the hand bars. Lift the weight while exhaling until your legs are almost straight. Do not lock your knees. Keep your back against the backrest and do not arch your back. Exhale and lower the weight back to starting position. Do three sets of eight to 12 repetitions.",
    "variations": "For a standing leg extension using a resistance band, you would anchor on end of the band behind you and loop the band around your ankle. Stand in a position where the band has no tension when your knee is bent with ankle behind you. Hold a rail or chair for balance as needed. Slowly straighten your knee to bring to the band under tension, maintaining a straight back. Extend as far as comfortable. Pause and slowly return to the starting position. Perform 10 repetitions, then do the same with the other leg.",
    "precautions": "If you have a knee, ankle, or thigh injury, seek guidance from your doctor, a qualified physical therapist, or strength and conditioning coach who specializes in weight training rehabilitation. They may say to avoid the leg extension machine. Critics say that open chain exercises like the leg extension can damage the knees and that even full-depth squatting is safer. Stop this exercise if you experience any pain in your knee or ankle. Be sure to follow proper form when doing leg extensions and mix up your quadriceps workout.",
    "muscles": "Quadriceps",
    "muscle_img": "https://chunkfitness.com/sites/default/files/leg-extensions-machine.jpg",
    "level": "Beginner"
  },
  {
    "id": 19,
    "name": "Vertical Leg Crunch",
    "image": "https://www.verywellfit.com/thmb/0hF7or-qNW32T8UVDCBT2oQYHjA=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/108-3120071-Vertical-Leg-CrunchesGIF-9f018c6dbc8d40edab0a1b36aba252c1.gif",
    "description": "The vertical leg crunch is a great core exercise. It is similar to the basic crunch, except that the legs are perpendicular to the floor. This position increases the intensity of the exercise, so it is a good next step after you've mastered the basic crunch. It can help your reach your goal of flatter and more attractive abs and a strong core. You can use this exercise as part of a core workout or a total body workout.",
    "benefits": "The rectus abdominis is the chief target of the basic crunch. The vertical leg crunch not only increases the rectus abdominis workout, it is effective for recruiting the lower back extensors, the transverse abdominals, and even the external obliques and internal obliques. Building your core muscles will increase your metabolism, which is key to burning fat throughout the day, even when you're not exercising. The vertical leg crunch helps improve your balance and posture by recruiting muscles along your spine. Changing up your ab routine is part of getting a full core workout, and there are variations and options to help you expand your ab exercise repertoire.",
    "instructions": "Place your hands folded behind your neck. Bring your legs up, extending them perpendicular to the floor with knees slightly bent. Keep your lower spine flat on the floor. Contract your abs in preparation for the lift. Begin by slowly curling your upper body, lifting your shoulder blades off of the floor. Exhale on the upward motion. Keep your legs straight and pointed upward; don't let them sway or list to one side. Continue curling your body upward using your core muscles. Don't lead with the head by pulling on the neck, and keep your chin up. When your shoulder blades are off of the floor, pause and hold the position a moment or two. Begin lowering the upper body by uncurling slowly. Inhale on the downward motion. Don't allow your legs to sway, and don't let them crash back to the floor. This should be a slow and controlled descent. Keep your legs in the fixed starting position. Repeat for 12 to 16 reps.",
    "variations": "The crunch is an exercise that can be done in many ways to make it more accessible as you build core strength or to work your muscles in different ways. Using a mat or other soft surface beneath the back is important—pushing your spine into a hard floor can be very uncomfortable. If you can't come fully up when you start, go as far as you can and return to the starting position. You'll improve as you practice.",
    "precautions": "If you have any back or neck problems, talk to your doctor or physical therapist about whether crunches are appropriate for you. If not done with proper form, they can compress the spine and stress the neck. Avoid crunches after the first trimester of pregnancy, as soon as the belly expands.",
    "muscles": "Abdominals",
    "muscle_img": "https://chunkfitness.com/sites/default/files/leg-raises-flat-surface_1.jpg",
    "level": "Intermediate"
  },
  {
    "id": 20,
    "name": "TRX Chest Press",
    "image": "https://www.verywellfit.com/thmb/GkW2PHD_B1j-QtlGlVmBSZna-M0=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/73-4589298-TRX-Chest-Press-GIF-c7b74ac6ab6941f9b71caf13d0720b62.gif",
    "description": "The TRX chest press uses suspension cables instead of typical weights. The exercise not only works your chest but helps to improve your balance and overall strength. Adjusting the level of difficulty for this exercise is an easy shift of your body position. Performing a chest press while suspended challenges your body in conditions of instability. This forces you to constantly engage your core to perform the movement. TRX training claims to provide an effective workout with simple equipment. This is one of the many popular reasons people are trying suspension training. The adjustable bands are suitable for the novice exerciser to the advanced athlete and can be modified to fit every fitness level. Many individuals are using this method of exercise to round out an existing exercise program.",
    "benefits": "The TRX chest press builds upper body strength and stability. The chest muscles are the primary movers involved but assisting the exercise are your shoulders, arms, and core. You may be working your chest, but at the same time, suspension training is shown to be an effective way to build muscle, strength, improve stability, and cardiovascular health. Because TRX involves so many muscle groups for every exercise, it can also benefit your day-to-day life activities. One of the many pros of this method of training is developing a strong core. A stronger core improves posture, helps relieve low back pain, and reduces the risk of injury. This is so important for functional fitness. You not only feel stronger, but you also feel better in general.",
    "instructions": "Attach cables to an anchor point above your head. Handles will hang down about waist high. Grab the handles with your hands facing away from the anchor point. Lean forward until your body is at a 40-degree angle, arms extended straight, core tight, and keeping your body straight from head to toe. Lower yourself down, bending at the elbows and until your chest reaches handle level in the center of the cables. Exhale as you push yourself up, maintaining a tight core, and back to start position. This completes one repetition. ",
    "variations": "Use a wide foot stand to reduce the stress/strain of the chest press. This will provide more stability during the exercise. Reduce the range of motion for the chest press. Move your body and feet back and away from the anchor point reducing the angle between your body and the ground. This creates a smaller range of motion allowing you to work at your fitness level. This can also be accomplished by shortening the suspension straps at the anchor point before performing the chest press. Stand with staggered feet similar to a lunge position. You will feel more stability and control as you work toward building upper body and core strength.",
    "precautions": "Workouts performed in unstable conditions require even more core engagement during the exercise. Because of this instability, it’s important to be aware of your body position and movement during TRX training including the chest press. Reduce your risk of injury: Be aware of your body position start to finish. Don’t allow your core to sag during the chest press. It’s better to stop and take a rest when you feel fatigued than hurt your back not being able to hold good form. Keep the straps from scraping your skin by setting up the cables and exercise properly. It may feel more stable resting the straps on your arms during the chest press but it makes the exercise less effective and creates an uncomfortable skin problem post workout. Avoid jerky movements during the chest press. If the exercise feels too hard, simply modify the movement to your fitness level.",
    "muscles": "Chest, shoulders, arms, core",
    "muscle_img": "https://chunkfitness.com/exercises/chest-exercises/middle-chest-exercises/bench-press-dumbbell",
    "level": "Beginner"
  },
  {
    "id": 21,
    "name": "Side Lateral Raise",
    "image": "https://www.verywellfit.com/thmb/9OhmipLgM3hbHTik5aNgICiGltM=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/61-4588211-dumbell-Lateral-side-Raise-GIF-7858592bcda347a9adf46886c5106e73.gif",
    "description": "The side lateral raise is an effective shoulder-strengthening movement designed to isolate the lateral head of the deltoid muscle. Performed regularly, this can help you develop stronger, broader shoulders. All you need is a pair of light dumbbells and enough shoulder flexibility to abduct your arms (lifting the weights out and away from your body) until they form a 'T' shape at your shoulders. Generally speaking, lateral raises should be incorporated into upper-body strength training routines, and they should be performed after compound exercises that incorporate the shoulder, such as incline dumbbell press, shoulder press, pushups, or pull-ups. This is similar to the dumbbell front raise.",
    "benefits": "The side lateral raise is a shoulder exercise that specifically targets the deltoid muscles. The deltoid muscle group actually consists of three separate points of origin (referred to as 'heads'), each with its own group of muscle fibers. The three heads of the deltoid then merge together before they insert on the upper arm bone (the humerus). The side lateral raise primarily targets the lateral head of the deltoid (although it also engages the anterior and posterior heads to a lesser extent), enabling you to isolate this muscle groups. Specifically, lateral raises are considered the best exercise available for working the lateral head of the delts.",
    "instructions": "Stand tall, a dumbbell in each hand at your sides, your palms facing in. Position your feet roughly hip-distance apart. Check your posture—roll your shoulders back, engage your core, and look straight ahead. Raise your arms simultaneously just a couple inches out to each side and pause. This momentary pause should help ensure you disengage your trapezius muscle from the movement, targeting the deltoids as intended. Lift the dumbbells up and out to each side, keeping your arms almost completely straight, stopping when your elbows reach shoulder-height, and your body is forming a 'T' shape. Breathe in as you lift the dumbbells. Pause and hold for a second at the top of the movement. Lower the weights slowly (take about twice as long to lower the weights as you took to lift them), bringing your arms back to your sides. Breathe out as you lower the dumbbells.",
    "variations": "The easiest modification for the side lateral raise is to simply bend your elbows before performing the exercise. This bent-arm lateral raise modification 'shortens the lever,'bringing the weight closer to your body throughout the movement. Perform it just as you would the regular exercise, but keep your elbows bent at a 90-degree angle throughout.",
    "precautions": "Selecting the correct weight is the single best thing you can do to prevent injury while performing a lateral raise. Check all the common mistakes—all of which are associated with improper weight selection—and if you notice yourself making a blunder, switch your dumbbells out for a lighter pair. The side lateral raise is a generally safe movement, but if at any point during the exercise you feel a sudden or sharp pain, stop your repetitions. You may want to try it again with the bent-arm modification to see if that alleviates the pain, but if the pain continues, discontinue the exercise for the day.",
    "muscles": "shoulders, deltoid",
    "muscle_img": "https://chunkfitness.com/sites/default/files/lateral-raises-dumbbell.jpg",
    "level": "Beginner"
  },
  {
    "id": 22,
    "name": "Decline Pushup",
    "image": "https://www.verywellfit.com/thmb/-idT8oQ7lmPWk2yoDnAW_6mMSgA=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/91-3120037--Decline-PushupsGIF-eb1210abbdb04bbf94a05aafb644b24f.gif",
    "description": "A decline pushup is an advanced variation of the basic pushup that increases the difficulty significantly by placing your feet higher than your hands. Adjusting the bench height allows you to customize the intensity of your workout using just your body weight. All you need is a bench, step, or some other solid object you can rest your feet on. Adding this exercise to your upper body strength training routine is a nice alternative to performing a basic pushup.",
    "benefits": "The decline push up is an advanced upper body exercise that targets the muscles of the chest, shoulders, back, and arms. In addition, maintaining the proper rigid body position requires a fair amount of strength and stability through the entire core, legs, and back. The pectoralis major is the prime target of this exercise, however, the height of the bench slightly changes the focus. A higher bench engages the clavicular head of the pectoralis major, but not the sternal head of pec major. A lower bench focuses on the sternal head of pec major, but it also engages the clavicular head of pec major as a synergist and helps with the movement. Other synergistic muscles that are active during the decline push up include the anterior deltoid and the triceps brachii. Raising your feet up a bit slightly changes the angle of movement, providing a slightly different range of motion. This minor change works the muscles in a whole new way. The decline pushup is one of many different ways you can modify a pushup.",
    "instructions": "Start on your hands and knees, place your hands on the ground, about shoulder width or a little wider. Be careful not to have them too wide or you will severely limit your range of motion on the descent. Carefully move your feet in position by extending your body, and propping your feet up on the bench, or step, one at a time. Realign your body so that it is in a straight line for shoulders to hips to toes, without sagging or arching at the hips. Reposition your hands if necessary, making sure your elbows are extended. Lower your chest by bending your elbows. Maintain an aligned body position and use a smooth controlled motion. As you lower to the ground, you will need to look up slightly to allow full range of motion and avoid banging your nose or forehead on the ground. As soon as you lift your head, you will want to arch your back but resist this temptation. Arching your back during this move is not helpful and could set you up for an injury. Push up until your elbows are straight, but not locked, returning to the start position. Repeat as many reps as you can do without compromising your form. When you can't complete another high-quality repetition, stop.",
    "variations": "If you are having trouble maintaining proper body alignment, you should not begin decline pushups. Keep working until you can do about 20 perfect basic pushups. Then you are ready to tackle the decline style. If not, consider taking the pushup test and find out just how your upper body strength measures up. If you are finding it too difficult to achieve good form, reduce the height or go back to the basics until you build up. Incline or wall pushups are the easiest, then bent knee pushups, then standard pushups.",
    "precautions": "You should not do pushups if you have a shoulder, wrist, or elbow injury. Talk to your doctor or physical therapist to see if this is an appropriate exercise. If you want to protect your wrists, you can place your hands on dumbbells or pushup bars to keep them in neutral position. If you feel shoulder pain during the pushup or hear a clicking noise in your shoulder, end the exercise.",
    "muscles": "chest, arms, shoulders, core",
    "muscle_img": "https://chunkfitness.com/sites/default/files/push-up-bosu-ball.jpg",
    "level": "Advanced"
  },
  {
    "id": 23,
    "name": "Incline Pushups",
    "image": "https://www.verywellfit.com/thmb/JGdRP8hzrlafuO9VTVCfsQ4HqPE=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/90-3120038--Incline-PushupsGIF-d321334ec54849539010832028d5635a.gif",
    "description": "Incline pushups are a great way to start a pushup routine if you have trouble doing the basic pushup. The exercise still targets the main chest muscles (the pectoralis major and minor) but puts far less stress on your elbows and significantly reduces the amount of body weight you are lifting. Incline pushups can be done just about anywhere. All you need is a stable surface such as a table, desk, or wall. This is perfect for beginners, for anyone doing upper body and shoulder rehab, or even seniors who need to build upper body strength to improve their quality of life and independence. It can be used as part of a bodyweight exercise routine. Even if you are able to do floor pushups, incline pushups are a nice pre-exercise warmup routine or a post-exercise stretch.",
    "benefits": "This simple movement targets the main muscles of the chest, the pectoralis major and minor. In addition to exercising the chest, the incline pushup engages the shoulders (deltoid), arms (triceps) as well a long list of muscles throughout the abs, back, hips, and legs that act as stabilizers and prevent any sagging or arching of the spinal column during the movement. Using a slow and deliberate motion can really engage your core. Incline pushups are the perfect compromise if you find that a standard pushup is too difficult or you have trouble easily getting down to the floor (and back up again). Incline pushups can allow you to progress from a simple 'push away' from a nearly standing position using a wall and then moving to a table, countertop, or sturdy chair, and eventually to a low step or bench.",
    "instructions": "Stand facing the bench, table, or the edge of a bed. Place your hands on the edge of the bench just slightly wider than shoulder width. Your arms are straight but elbows are not locked. Align your feet so that your arms and body are completely straight. Bend your elbows to slowly lower your chest to the edge of the bench while inhaling. Keep your body straight and rigid throughout the movement. Push your body away from the bench until your elbows are extended, but not locked. Exhale as you push up. Keep going with slow, steady repetitions.",
    "variations": "If starting from a 3-foot surface is too challenging, the least aggressive incline pushup is done using the wall to create the incline. Here's how to do it right: Stand facing a wall, with your feet a few feet from the wall. Lean in slightly and place your hands on the wall just wider than shoulder width. Slowly and deliberately bend the elbows and move in as close to the wall as possible, inhaling. Slowly and deliberately push off the wall until your elbows are straight, but not locked. Exhale as you push up. Repeat as many as 20 reps to build strength and endurance.",
    "precautions": "You should not do pushups if you have a shoulder injury. If you feel shoulder pain during the pushup or hear a clicking noise in your shoulder, end the exercise. Incline pushups are easier on the wrists and elbows than floor pushups, but you should use caution if you have any wrist or elbow injury. Talk to your doctor or physical therapist to see if this is an appropriate exercise.",
    "muscles": "Chest, shoulders",
    "muscle_img": "https://chunkfitness.com/sites/default/files/push-up-bosu-ball.jpg",
    "level": "Beginner"
  },
  {
    "id": 24,
    "name": "Biceps Cable Curl",
    "image": "https://www.verywellfit.com/thmb/LFFgkKri2rgahcq6c3gN6BCpoQc=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/54-3498289-Biceps-Cable-Curl-GIF-204a7e1692d44c78950100362cc5b986.gif",
    "description": "The biceps cable curl is an isolation exercise for the upper arm biceps muscle. It’s a pulling action performed with a cable machine and is suitable for beginners. The cable curl is performed standing facing one end of a cable machine with the cable fixed at the bottom of the machine and set with an appropriate weight. Feet are flat on the floor with one or both hands holding a cable handle. This exercise can be used as part of an upper body strengthening program or muscle building program.",
    "benefits": "The primary target of the cable curl is the biceps brachii muscle. This is the muscle that flexes the elbow, which is why it is worked when you curl the arm. It connects the scapula with the radius of the forearm. Synergistic muscles worked during the cable curl are the brachialis and the brachioradialis, which are also used when flexing the elbow. While doing the cable curl, other stabilizing muscles come into play in the shoulder and upper back—the anterior deltoid, trapezius and the levator scapulae. Your wrist flexors are also used. Building the biceps gives an appealing look to the upper arms for both men and women. You see them in the classic arm flex to show off muscles. Building the biceps can help flesh out the upper arm if you have sagging skin following weight loss or due to aging. You use the biceps brachii every time you raise your arm or bend your elbow. Strong biceps help you pick up and carry objects such as boxes, grocery bags, a laundry basket, or cradle a child. Beyond looking muscular or toned, having strong biceps makes daily life a little easier.",
    "instructions": "Stand comfortably with feet firmly placed on the floor. Brace the abdominal muscles, straighten the back, keep the head steady. Curl the cable weight upward toward the chest, breathing out. Only your forearms should move, rising up from the elbow. Hold at the top of the contraction for one second. Inhale and unbend the arms at the elbow to let the cable weight return the arms to the lower resting position. Stop before the weights return to the stack, keeping the cable under tension. Complete the chosen number of repetitions (10 or 12 is a good number)",
    "variations": "This exercise can be done in different ways, making it more accessible as a beginner or progressing as you build strength. You can do the cable biceps curl seated if you need more stability or suspect you are using your legs and back. Use light weights and only increase the weight as you are able to do your desired number of reps with good form.",
    "precautions": "Avoid this exercise if you have an injury to the elbow or wrist. You will be working your muscles to fatigue, but not to the point of pain. If you feel any pain, end the exercise. Always warm up before you do strengthening exercises and take your joints through the complete range of motion.1﻿ Check to ensure the weight set on the machine is one you can lift with good form. Vary the types of strength exercises you do so you can avoid repetitive strain. Give yourself 48 hours between difficult workouts for a muscle group.",
    "muscles": "Biceps",
    "muscle_img": "https://chunkfitness.com/sites/all/themes/cf2/images/muscle-charts/original/arms.jpg",
    "level": "Beginner"
  },
  {
    "id": 25,
    "name": "Hip Lift",
    "image": "https://www.verywellfit.com/thmb/WczjrI9RfpF2bFyP4GlSl_Zddjc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Fitness_Gif-1500x1000_reverse-crunch-5939a6933df78c537ba31620.gif",
    "description": "The hip lift is a good ab exercise to strengthen your major abdominal muscles as well as the deep abs. It is less stressful on the back than some ab exercises such as crunches. Try to work up to two sets of 10 to 12 repetitions, with a short break between sets. Add this exercise to a core workout or a total body workout two to three times per week.",
    "benefits": "The primary muscle used in this exercise if the rectus abdominis, which is the 'six-pack' muscle that draws your ribs to your hips. Secondarily it recruits the obliques, which are the muscles that run down the side of your torso, and the deep transverse abdominis that stabilizes your spine and core. This deep ab muscle is especially hard to work with other core exercises. By developing a strong core you will help improve your posture and be better able to stabilize your movements.1﻿ That can help with sports performance as well as in daily life. Because you do the exercise with slow and controlled motions, it can help build these muscles for that sought-after ab definition. In fact, the American Council on Exercise has said this is the seventh most effective ab exercise.",
    "instructions": "Pull your navel in toward your spine. Inhale. Exhale as you lift your hips a few inches off the floor, keeping your legs pointed straight up. Your hips should leave the floor as you push your legs up toward the ceiling. Really pull in the lower abdominal muscles during the lift. Don't lift your head during the lift, but keep it resting on the floor. Slowly lower your hips back to the floor, inhaling as you do. Your legs return to the starting position, in the air with your knees aligned with your hips. Your legs can be straight or knees bent. Repeat 10 to 12 times for one set. At the end of a set, gently return your legs to the floor.",
    "variations": "Find the knee angle that works best for you. Your knees can be bent or your legs can be straight, just so long as your knees are lined up over your hips in the starting position. Some people also find it more comfortable to cross their ankles. If you are doing the exercise with bent knees but are having problems in isolating your abs, place a foam roller between your knees and calves. Squeeze it so your legs won't get involved in the lifting motion.",
    "precautions": "You should not feel pain in your lower back, hips, or neck while performing this exercise. If you do, gently come out of the position and end the exercise. You are likely to feel quite a burn in your abdominals, but you should not feel any sharp pain.",
    "muscles": "Abdominals",
    "muscle_img": "https://chunkfitness.com/sites/all/themes/cf2/images/muscle-charts/original/abs.jpg",
    "level": "Beginner"
  },
  {
    "id": 26,
    "name": "Seated Oblique Twists",
    "image": "https://www.verywellfit.com/thmb/wyd_lFS_tthPSJJTfGud1hDR0Vw=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/86-3120067-Seated-Oblique-twists-GIF-75816d0fb4c94494b254483a1fe1e365.gif",
    "description": "The seated oblique twist exercise, sometimes called the Russian twist, is a very effective exercise for strengthening the abdominal muscles. Using a medicine ball in the exercise adds a challenge to the workout. You can do this exercise as part of a core strengthening workout along with exercises such as the plank, crunch, and bridge. It can be also part of a total body strengthening workout and is especially good if you are in a sport where you throw a ball or swing a club.",
    "benefits": "The oblique twist is a great exercise that works many muscles in your core. Not only does it exercise the rectus abdominis, but it also hits the external obliques and internal obliques. Using a weight, medicine ball or stability ball in the exercise adds tension to the core muscles, really giving them a workout. Strengthening the core muscles is important to your health and fitness. A stronger core protects your spine, promotes good posture, and helps with balance. If you sit at a desk for work, for example, your strengthened core will help you sit with better posture. This can help you avoid lower back pain and lessen overall exhaustion and muscle soreness. Athletes in sports that require rotational power (as in golf) or throwing may see improvement in their game from this exercise.",
    "instructions": "Sit on the floor with your knees bent and feet flat on the floor (easier) or raised up off the floor (more difficult). If you have difficulty holding the position and your feet shift about, try tucking them beneath a stable object. Contract your abs and sit at about a 45-degree angle. Hold the medicine ball with both hands, directly in front of you. Contracting your abs, twist slowly from your torso to your right and touch the medicine ball to the floor beside you. Pause to hold the position a moment. Quickly, but smoothly, contract your abs and twist your torso back to the center position, and then proceed on to touch the medicine ball to the floor on the other side of you. Repeat for the desired number of reps. To end, bring the ball in front of your body and sit up. Carefully place the ball on the ground without undue twisting.",
    "variations": "If you can't find a medicine ball to use at your gym, you can use other weights in a variation. For example, hold a weight plate firmly by the edges between your hands with arms extended outward in front of you and perform the exercise. Twist until your arms are parallel to the floor on each side. If beginning with a medicine ball is too challenging, perform the exercise with nothing your hands. Hold your arms extended out in front of you and follow the same motion as described above. Twist to each side until your arms are parallel to the floor (since there's no ball to touch to the floor). This will help you become familiar with the exercise and build up your strength to the point that you can add the medicine ball to the exercise.",
    "precautions": "This exercise places a lot of stress on the lower back, so it should be avoided if you have a back injury. If you feel any pain in your back or shoulders, end the exercise.",
    "muscles": "abdominals, obliques",
    "muscle_img": "https://chunkfitness.com/sites/all/themes/cf2/images/muscle-charts/original/abs.jpg",
    "level": "Intermediate"
  },
  {
    "id": 27,
    "name": "Cable Pulldown",
    "image": "https://www.verywellfit.com/thmb/8F7KZT6VqL42xxI-cpFWeYbGUdw=/768x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/57-3498474-Cable-Pulldown-GIF-af6c33517ac84b209086e0723d90890f.gif",
    "description": "The cable pulldown exercise uses a weighted cable system to target the back, arms, and abdominal muscles. It is a compound, multi-joint movement that builds strength and requires your body to engage the core and abs for balance while performing it. The cable machine allows you to choose the appropriate weight for your fitness level. Use this exercise as part of an upper body strengthening workout.",
    "benefits": "The latissimus dorsi muscle, which runs the length of your back, is the primary target of the cable pulldown. Developing this large back muscle can give a desired look to the torso as well as building strength. The synergistic muscles involved are the pecs of the chest, the triceps, deltoids, rhomboids, and levator scapulae. The muscles that work to stabilize the move are the triceps, pectoralis major, wrist flexors, and the abdominal muscles: rectus abdominis and obliques. The compound motion is one used in daily life for tasks as simple as drawing the blinds. Learning to engage your abs when pulling will help you develop core stability.",
    "instructions": "Brace the abdominals. Grab the hand attachments in an overhand grip about shoulder-width apart, with elbows locked and arms straight. Keep your knees soft rather than locked. Breathe out while pulling the cable down to your thighs in a smooth, controlled motion, arms remaining straight, hips bending slightly forward while keeping the back straight. If you do this exercise properly, you will find that your abdominal muscle will work hard and your arms and back will also get some work. Pause when the hand grips are at thigh level. Inhale while allowing the weights to return up to full arm extension above your head. End in a position where there is still tension on the cable before doing the next repetition. Do three sets of 10 to 12 exercises.",
    "variations": "This exercise can be done in different ways to make it more accessible or provide progression as you develop your muscles. You could also use stretch bands or tubes at home attached at the top of a closed door rather than a cable machine. An alternative is to do this exercise kneeling. Set the attachment point up so that you can reach the handle while kneeling. The execution of the exercise is similar with the abdominals being squeezed on the downward pull of the cable and weight.",
    "precautions": "If you have a wrist, elbow, shoulder, or back injury, talk to your doctor or physical therapist to find out whether this exercise is appropriate for you. You should not feel any pain during this exercise. If you, end the excise.",
    "muscles": "Back, arms, abs",
    "muscle_img": "https://chunkfitness.com/sites/default/files/external-arm-rotations-cable.jpg",
    "level": "Beginner"
  }
]
